[
    {
        "s_no": 1,
        "movie_title": "The Hateful Eight",
        "movie_year": "2015",
        "director_name": "Quentin Tarantino",
        "imdb_rating": "7.8/10",
        "movie_url": "https://www.imdb.com/title/tt3460252/",
        "cast": [
            "Samuel L. Jackson",
            "Kurt Russell",
            "Jennifer Jason Leigh",
            "Walton Goggins",
            "Demian Bichir",
            "Tim Roth",
            "Michael Madsen",
            "Bruce Dern",
            "James Parks",
            "Dana Gourrier",
            "Zoe Bell",
            "Lee Horsley",
            "Gene Jones",
            "Keith Jefferson",
            "Craig Stark",
            "Belinda Owino",
            "Channing Tatum",
            "Quentin Tarantino"
        ],
        "latest_10_reviews": [
            {
                "review_title": "Tarantino does it again",
                "review_text": "I've never considered myself a Quentin Tarantino fanatic, but I have to admit that I find most of his films highly enjoyable and this one is no exception, undoubtedly a worthy addition to his illustrious catalogue.The movie starts and we are out in the wild. The scenery is hostile but nonetheless gorgeous in typical Western fashion. It's so well done you feel you'll start freezing at any moment. The opening scene already sets the tone: erratic characters, suspicion, secrets, dirty mouths and of course a gunfight is always round the corner.By the way, style over substance is a common criticism regarding Tarantino's work and while it's true The Hateful Eight is dazzlingly stylish, this doesn't detract from the story - quite the contrary, it makes for even more compelling storytelling. There are very few moments where the Tarantino touch would qualify as over the top or unnecessary.One defining feature of the movie is that more or less in its entirety takes place in one room, a risky choice on paper, which definitely works here, as it creates interesting dynamics between this group of seemingly random characters who are busy trying to survive the frost and solve an Agatha Christie type of mystery. It's fascinating watching the tension reach a boiliing point, a bloodbath waiting to happen.Every character has an interesting background on his own, but it's the interactions between them that elevate the movie to the next level. This is achieved mostly through dialogue, one of the movie's highlights. Punchlines are fyling left and right, people start ranting and raving out of nowhere, while the occasional socio-political commentary adds another element. There are also non-verbal details, amplified by the fabulous cast. Even though it's hard to sympathise with any of them - they are hateful, indeed - they are presented in a three dimensional way that invites you to see their point of view and try to understand their state of mind and guess their motives.Ennio Morricone delivers as usual, though the music is not one the first things that stand out, one could argue his presence is rather thin.The movie totally justifies its relatively long running time, as it flows effortlessly and doesn't drag at any point.",
                "user_rating": "8/10",
                "review_date": "27 December 2023"
            },
            {
                "review_title": "One of Quentin Tarantino's many greats!",
                "review_text": "\"The Hateful Eight\" is a wonderful western film that is somewhat of a murder mystery in which all of your questions slowly get answered. I liked this movie mainly because it's a Quentin Tarantino film, and all of his films are really funny and intriguing. Samuel L. Jackson was also a really big part in this movie and most of Quentin's other works as well. The casting in this movie was absolutely stunning in terms of performance and popularity and I love that Quentin Tarantino can keep it consistent in his films with his cast. This movie really has no flaws and the director only helps even more, 10/10, thank you Quentin Tarantino.",
                "user_rating": "10/10",
                "review_date": "14 December 2023"
            },
            {
                "review_title": "Dialogue heavy Tarantino classic",
                "review_text": "QT has always delivered in his ability to put the viewer in the shoes of the characters through heavy dialogue, even when the conversations seem monotonous or insignificant this tactic really gives the viewers a feel for what it would be like in the shoes of a [hitman, robber, outlaw, bounty hunter]. This movie is the pinnacle of this and the performances by the whole cast keeps the viewer engaged, cold and claustrophobic throughout its entirety. I can see why some may not approve, however, if you are a fan of Tarantino and westerns, then this will be a gem. My review is too short so words words words.",
                "user_rating": "8/10",
                "review_date": "11 December 2023"
            },
            {
                "review_title": "I definitely don't hate it.",
                "review_text": "I think tonight was the first time I've seen this since it was in cinemas. I vaguely remember seeing it twice at the movies - both during Southern Hemisphere summer. It's now December, which is the start of summer in the Southern Hemisphere. I don't feel like I'm doing The Hateful Eight many favors by watching it while the weather's warm.I'm not sure I can add much to what other people say about The Hateful Eight, because I generally agree with the general consensus. It is not nearly one of his best films, but it's still packed with great dialogue, some incredibly strong acting, and beautiful/distinctive visuals mixed with an excellent Ennio Morricone score that finally got him the Oscar win he should've gotten like, 50 years earlier, for one of the Sergio Leone Westerns.Something that I do feel has impacted the 2010s era (and perhaps beyond) of Tarantino's filmography is the loss of Sally Menke. She edited movies of his that were long and sometimes patiently paced (Pulp Fiction and especially Jackie Brown - both of which were over 2.5 hours), but things felt more purposeful and tighter. She was someone who was able to tell Tarantino no, it seemed, but she didn't tell him no just to get a kick out of things. She told him no when he was unable to realize, and he seemed to listen. Just about every movie of his she edited has perfect pacing. Django Unchained, The Hateful Eight, and Once Upon a Time in Hollywood... I really like all these movies, but each feels about 15 minutes too long and all run the risk of feeling a tiny bit dragged down in places.Because everything else outside the editing works, these three most recent Tarantino films are still a blast. I've seen Django Unchained three times I think, Hateful Eight three times, and I know I saw Once Upon a Time in Hollywood twice in cinemas. I really like these films, but I don't love them.I also thought I might complain about how mean The Hateful Eight is, but that's totally the point. It's in the title, and the film is Tarantino deliberately pushing things far and having a whole cast full of jerks just abuse, taunt, and eventually kill each other. Subjectively, I can say I like it when some of his characters have a little heart (Jules realizing the errors of his ways in Pulp Fiction, the motherly instincts of The Bride in Kill Bill, the genuinely sweet connection between Pam Grier and Robert Forster's characters in the surprisingly heartfelt Jackie Brown), but that's just me. Objectively, Tarantino made a movie called The Hateful Eight, and at least eight of these characters were crazy hateful. It hits me that Tarantino absolutely made the exact movie he wanted to make, and I have to respect any kind of vision this vast being realized.",
                "user_rating": "8/10",
                "review_date": "7 December 2023"
            },
            {
                "review_title": "6 Stars, But Only For the Musical Score.",
                "review_text": "Unlike Quentin Tarantino the legendary film musical score composer Ennio Morricone didn't try to repeat himself. On the contrary, he did seek to avoid it, and even if this film's director hopefully didn't expect another timeless stroke of new inventional genius like in Sergio Leone's masterpiece, the iconic The Good The Bad And The Ugly, he probably didn't quite expect what he got, regardless. However, The Hateful Eight is far from a masterpiece, and not even a fully fitting musical score from the very best can make Tarantino's study of western clichés, and his signature hyper violent final into a great film. Nevertheless, just listening to the Maestro's music is much more interesting. Still, I wish that Ennio Morricone would get his well deserved Oscar for Cinema Paradiso instead, like he should.",
                "user_rating": "6/10",
                "review_date": "14 November 2023"
            },
            {
                "review_title": "Tarantino needs to go to Broadway",
                "review_text": "My first Tarantino film where I felt bored. Talk, talk, talk, talk, kill. Once you get the rhythm down it becomes repetitive. I have always felt that Tarantino the director has done an excellent job of editing Tarantino the writer. Not this time. Feels like a play in almost every aspect. Great performances, great score, great cinematography. All take a back seat to the overly verbal screenplay. I think Tarantino would make a brilliant Broadway writer. He is very suited for it. But as film it is less than the sun of its parts. He rebounded nicely with Once Upon A Time In Hollywood. The only other film of his that was similar was Reservoir Dogs. It basically took place in one location, a where house. It was also overly written.",
                "user_rating": "5/10",
                "review_date": "19 October 2023"
            },
            {
                "review_title": "Extended version review",
                "review_text": "Pros:A lot of suspense and tension filled sequences\nThe film truly shines when Sam Jackson is in control\nYou don't know what will happen next\nIf that was really the actress' voice singing while playing the guitar, that was really impressive! As was her performance.Kurt was goodCons:Way way, too long\nBoring at times\nOverdrawn, convoluted, irrelevant conversation does little to add value to the movie\nWay too much use of the \"N\" word\nWe aren't meant to care about any of 8 outside of Kurt and Sam which are essentially the \"protagonists\" of the movie\nChanning Tatum?Hiding under the floorboards is reminiscent of inglorious basterds\nHuge plot hole is that Kurt has his back turned several times to board the door shut him when just him and the prisoner first entered, more than ample opportunity to pop him quick.",
                "user_rating": "7/10",
                "review_date": "19 October 2023"
            },
            {
                "review_title": "A Tense Snowstorm of Suspicion and Secrets",
                "review_text": "Quentin Tarantino's 'The Hateful Eight' is a masterclass in suspense, dialogue-driven tension, and character interplay. Set predominantly in a single, claustrophobic location during a raging blizzard, the film grips you with its intricate narrative and keeps you guessing till the very end. Tarantino's signature style of long, engaging conversations and sudden bursts of violence is ever-present, making every moment an unpredictable thrill. The ensemble cast, featuring the likes of Samuel L. Jackson, Kurt Russell, and Jennifer Jason Leigh, delivers performances that are both riveting and nuanced. Ennio Morricone's haunting score adds another layer of unease, perfectly complementing the movie's bleak and tension-filled atmosphere. 'The Hateful Eight' is not just a film-it's an immersive experience into the minds and motives of flawed individuals forced into a perilous situation. It's a Tarantino spectacle in its rawest form, making it an essential watch for fans of intense, dialogue-driven cinema.",
                "user_rating": "10/10",
                "review_date": "13 October 2023"
            },
            {
                "review_title": "Some excellent parts, and some boring parts",
                "review_text": "There are some excellent, tense, and well acted scenes sprinkled throughout, but the film is about 30 minutes too long. Some of the scenes are drawn out way too long. I can't believe there's an extended version of this.I enjoyed the film once they got to the Haberdashery, but pretty much everything that happened before they arrived there could have been cut from the film.While I feel the ending is appropriate, I don't like it. I'm not entirely sure why, but it bothers me the way the film concluded.The cinematography and effects are excellent though and the setting really adds to the tension of the story, but I really have no desire to ever watch this one again.",
                "user_rating": "7/10",
                "review_date": "27 September 2023"
            },
            {
                "review_title": "I didn't care about any of them eight hateful guys and that was the only problem.",
                "review_text": "The Hateful Eight.In the dead of a Wyoming winter, a bounty hunter and his prisoner find shelter in a cabin currently inhabited by a collection of nefarious characters.Obviously, this is a very good movie but I ended up disappointed somehow.It's a slow burning thriller, you can't know what is going to happen next, very hard to predict as a western movie should be and as a Tarantino movie should be most particularly.The atmosphere was there, those snowy scenes were great with those beautiful soundtracks and the cinematography was just wonderful.Nothing bad about directing, it's a masterclass from the man himself Quentin.I really enjoyed the dialogs either, they were mostly well-written and funny especially Samuel L. Jackson and Walton Goggins, those were the funniest but the best performance here is by far 's.I have to mention that I really didn't care about any of them eight hateful guys, I didn't know much about them to care so that was a thing that bordered me and I tried to enjoy the thing and the mystery and I did but not quietly like I wanted.Once again this is a good movie, a very well-made western and I wish I could love it a bit more.",
                "user_rating": "7/10",
                "review_date": "31 August 2023"
            }
        ]
    },
    {
        "s_no": 2,
        "movie_title": "X",
        "movie_year": "2022",
        "director_name": "Ti West",
        "imdb_rating": "6.5/10",
        "movie_url": "https://www.imdb.com/title/tt13560574/",
        "cast": [
            "Mia Goth",
            "Jenna Ortega",
            "Brittany Snow",
            "Kid Cudi",
            "Martin Henderson",
            "Owen Campbell",
            "Stephen Ure",
            "James Gaylyn",
            "Simon Prast",
            "Geoff Dolan",
            "Matthew J. Saville",
            "Bryony Skillington"
        ],
        "latest_10_reviews": [
            {
                "review_title": "Nice, Familiar Comfort Food",
                "review_text": "Though X doesn't necessarily bring anything new to the table, it's commendable in how it manages to pay homage to the films it's inspired by and also track its own path through.The cast impresses with the likes of Mia Goth, Jenna Ortega, and Brittany Snow among other familiar faces. Directed and written by Ti West, he's brought a strong premise and a diverse cast of characters to a centralized location and lets everything play out in spectacular fashion.There's some great kills in the film as well.Though not everything is fantastic (Jenna Ortega's character went out with a whimper instead of a bang, despite getting her head half-blown off), the film is greater than the sum of its parts. And as a growing part of a franchise, it's the best of the series thus far.",
                "user_rating": "9/10",
                "review_date": "2 January 2024"
            },
            {
                "review_title": "\"People's eyes are gonna pop out of their damn skulls when they see this.\"",
                "review_text": "FILM: 7/10.In Ti West's foray into the realm of classy slashers with X, he takes the genre on a highbrow escapade-well, his version of it. The film mirrors this ambition as characters embark on a quest to shoot a high-class porno, setting the stage for an unconventional yet intriguing experience.West succeeds in delivering more than your typical titillating slasher. Character development takes the spotlight, providing a depth rarely found in the genre. As the plot unfolds, it becomes evident that West is not interested in taming the horror; he aims to send shivers down your spine with graphic kills that punctuate the narrative.The performances across the board are nothing short of excellent, capturing the essence of the 1979 setting. Mia Goth shoulders the lion's share of the work, while Brittany Snow proves to be very effective. Kid Cudi, in a surprising turn, delivers an excellent performance that adds to the film's overall charm.However, the film misses an opportunity to explore a potentially compelling connection between Maxine and Pearl, two characters whose untapped dynamic could have elevated the narrative even further. Despite this, X stands as a highly entertaining and well-made horror film, showcasing West's ability to infuse sophistication into a genre often associated with gratuitous thrills. West's journey into classy horror is one worth taking.FORMAT: Blu-rayVIDEO: 9.5/10.1080p presentation\nDetail level: Excellent, Colour reproduction: Excellent, Level accuracy: Excellent, Encode: Excellent, Master condition: ExcellentAUDIO: 9.5/10.DTS-HD MA 5.1 audio, Dialogue reproduction: Excellent, Soundtrack & effects clarity: Excellent, Dynamics: Excellent, Surround sound presentation: Excellent, LFE content: ExcellentMOOFIEMETER: 7/10.",
                "user_rating": "7/10",
                "review_date": "1 January 2024"
            },
            {
                "review_title": "Tries to be too many things ends up being not much",
                "review_text": "The early scenes with the fixed long shot look perfectly 70's horror. That got my hopes up. Add in the creepy farmhouse and some decent moments of building tension along with a couple jump scares and I was thinking it was going to be quite good.The sex scenes are a bit more involved than the early horror, Friday the 13th, type movies; but it still follows the formula.Then about halfway through, it switches to the gross/icky type of horror movie. And around then it also becomes the very predictable horror movie.The main cast was actually really good. That gave me a lot of hope for the movie early on. The old couple was not good, especially the 'old' lady and their story line was also pretty bad.A key to good horror movies is wanting to yell at the main characters to not do something or to get out of there. But no matter how much I liked the main characters their deaths were so predictable and the old couple was so distracting that it ruined the shock.",
                "user_rating": "4/10",
                "review_date": "31 December 2023"
            },
            {
                "review_title": "What a snooze fest",
                "review_text": "It's so sad to see amazing films come out of A24, and then have to rate them next to this... whatever this is.To say this film was boring is an understatement. This film DRAGGED the entire way through. The timing of the kills was even off. Found myself skipping through the intense scenes because you can only stab someone so many times before it looses its shock value.There is a lack of plot this entire movie other than old people wanting to yoink each other, but they are too old so they need some young people to do it for them?It's also a highly unbelievable film as they have the old couple killing couples in their 20's/30's in very mobile ways but they are introduced being very pitiful and Ill.Wanted to see why \"Pearl\" is rated so highly and this was barley talked about. Guess we know why now.",
                "user_rating": "2/10",
                "review_date": "30 December 2023"
            },
            {
                "review_title": "If you wondered why people liked it... me too",
                "review_text": "There is truly nothing to this movie. I would say the greatest offense is that even if it was an \"homage\" to classic slashers, it adds nothing to nor does it reflect the best of the genre.There is no pay off. No suspense. It is utterly devoid of creativity. Plenty of people will say it was just a good ol tits'n'guts movie but there are legit better ones that don't pretend to be more than they are. This is that kid in class who pretends they DISCOVERED Evil Dead.It is painfully boring and when the only redeeming part (murders) comes to a head they are boring. That's this movies sin. It is boring.",
                "user_rating": "2/10",
                "review_date": "28 December 2023"
            },
            {
                "review_title": "In \"X', Tie West ventures into the slasher category, using as a reference the cinema of the revolutionary and subversive Tobe Hooper",
                "review_text": "In his newest film, \"X', Tie West ventures into the slasher category, using as a reference the cinema of the revolutionary and subversive Tobe Hooper. More precisely, West focused on Hopper's first two films that received commercial appeal, namely \" The Texas Chainsaw Massacre (1974)\" and \"Devoured Alive (1976)\". Considered the pioneer of the slasher before \"Halloween\", the film that immortalized the figure of Leatherface is a unique piece in the history of cinema, and although not told a true story, as was announced at the time of its release, it had a categorical particularity in presenting a premise so terrifying and disturbing that it seemed to be a real record at times, about a brief trip between friends that had a brutal and suffocating outcome Following the shocking sick representation of human perversity, \"Devour Alive\" featured another ghastly plot in which an old owner of a roadside hotel killed potential guests and served them as food for his pet crocodile.Knowing the many interpretations of \"The Texas Chainsaw Massacre\" in the American cultural context, its impact as a landmark of visual change for horror, language, and also as a precursor to the generic elements that characterized the subgenre, Ti West arrived in his slasher subversive \"X\", which points a lot of inspiration to those who strongly influenced the niche, which also includes nods to \"Psycho (1960)\" by Alfred Hitchcock (as well as \"Eaten Alive\" composed), but still, manages to deliver a result clayey and authentic. In the wake that paved the way for an impressive recognition of Hooper's classic, it was the same one that also promoted controversial discussions for an archetype condemned in the film with regard to female representation. If the final girl originated from there, it was possible to observe a contradiction behind the image of the final girl, because she received that name after having all the misfortune and violence prolonged longer than other characters, and in the end, surviving. In this discursive liner, West focuses his story to talk about the search for female independence, the escape from the role played by patriarchy through Maxine (Mia Goth), the protagonist who aims for her emancipation and success as a porn film star. The year is 1978, and here we follow a group of young adults in the race to shake up the porn industry with a feature film with a more elaborate and authorial language than what productions used to deliver at the time.\"X\" is divided into two parts with very different tones. In the first, by the way, the best of them, there is the construction of a great atmosphere of expectation. In the midst of preparing the ground for a carnage announced from the first scene - basically, the entire plot is one big flashback -, Ti West displays several signs of intertextuality, that is, how much he will drink from the fertile sources of his reference. One of them is Psycho (1960), a film by Alfred Hitchcock cited as one of the favorites of the director's character with artistic ambitions, one who is committed to making \"quality porn\". Later on, when the killing begins, the appearance of the car partially submerged in the lake is a creative way of diversifying the nod to good old Hitchcock's masterpiece, now with something from the film manifesting itself in the narrative fabric. Therefore, intertextuality has distinct layers and ways of being. Another of them is the reappropriation of a slasher commonplace: sexual rage as an indication of who is going to die. Even the two characters who don't have sex end up dying brutally. But what changes here is the motivation of the villains. Out comes the pure juice of abstract redneck moralism and in comes sexual repression enhanced by the messianic discourse of religious people who contribute to this repression. The script signed by West points out that this violence has a source.The second part of \"X\" is the massacre itself. But, before talking about it, it is good to consider the curious figure of murderous hosts. Pearl (Mia Goth) and Howard (Stephen Ure) are isolated people, emotionally trapped in a distant time of glory. However, beyond this aspect that helps to contextualize the murderous rage, there is an aesthetic choice by Ti West: the clearly fake makeup that transforms two relatively young actors into cachectic elderly people. This choice is part of an apparently deliberate movement towards the artificial, a wink at the audience regarding the purely cinematic nature of what they are watching - there are many other moments in which the plot asks us to turn off disbelief and adhere to artifice. When the old men take action, the story plunges into a spiral of more or less predictable brutal deaths until only the final girl remains - a famous narrative trope in horror productions, the survivor who faces the evildoers last and who (usually) is left to tell the story. Therefore, adherence to models established by other films takes place within a new layer of intertextuality, with tradition serving as a source of nourishment and emotional inspiration. As for slave deaths, it is therefore not a question of \"if\" they will happen, but of \"when\" and \"how\".West's filmic structure, which is configured by the slow way in which the narrative is conducted, valuing how language can tell a story, gains points in the way in which the premise unfolds, thus showing planning (and not the sensation as in other works, from the potential being with you in favor of chaotic twists) to having pornography as a background on the female independence that \"X\" discusses, in addition to the degradation of humanity in the face of banal repressions and vanities. The title of the film follows the beauty of the mystery that is Maxine, being referred to as an x-factor, a difference, someone of notable and special quality. The character is enigmatic, with few dialogues, but who does not spare herself when she needs to impose her personality and preferences, and there is a shock in this profile when she is close to Pearl, the scary lady, who runs the farm alongside her husband, Howard (Stephen Ure).The way Pearl is presented draws attention due to the setting's always dim lighting, her intimidating posture and her undeniable feeling of being seduced by Maxine. While the young woman's search, in which each decision is a consequence of the strength and success of her autonomy, is what defines her trajectory, for Pearl, facing a woman who in her own youth exudes freedom, confronts her denial, bitterness and dissatisfactions that hide in her idyllic farm. Giving more strength to this dichotomy, her names become an allegory in how Pearl (pearl) sees herself, with Maxine (maximum) being the example of achievement that she did not achieve, although her name refers to something precious, lasting. Therefore, Eliot Rockett's photography was fundamental for maintaining a careful play of shadows to manifest a character lost in repressed feelings.Still on the technical side, photography and costumes stand out in recreating an atmosphere that takes us directly to the films of the 70s to this \"X\" - everything looks like a vintage filter). And before I say that everything seems too \"artificial\" or \"decorated\", Ti West brings out the great cast who, super comfortable in their roles, make the fun happen. The script and the construction of the characters have weight in this, with the twist that the protagonist's plot undergoes in the last moments being one of the best moments of this creation. The discussion between puritanism and \"sin\", a classic slasher subplot, is turned inside out by a body of well-developed characters and highlighted in excellent dialogues that subvert the roles traditionally imposed by society - something that is not surprising to us, given that it seems We are much more likely to see coherence and integrity in a bunch of porn artists than in \"church rats\" and religious conservatives in general.By openly gesturing to the slasher audience with such clear affiliations to the subgenre's conventions, Ti West doesn't seem concerned with the predictability factor. After the first murder takes place, the feature film simply relies on the construction of the graphic aspect of the deaths, losing a little interest in the atmosphere of suspense that had created such an interesting and rich panel in its first half. The games with the supposed clandestinely of pornographic films, with the artistic intentions of the jealous beginner filmmaker, with the clichés linked to the performers of productions for adult consumption, with the stereotyping of almost caricatural villains and even with the texture of the image, come out. A sequence of savage eliminations of outsiders linked to cinema. Among these deaths, there are some filmed with ingenuity and very well calculated touches of cruelty - like the lady stabbing someone until the knife gets stuck in a vertebra. There are others that are practically jokes with certain recurrences of terror - like someone who clearly shouldn't look into the holes in a stable wall. But, overall, this somewhat repetitive carnage (brief isolation of the character about to die plus conclusion with touches of nonsense) serves as much as its intertextuality weighs, the balance of which is the commotion provoked through the sharing of familiarity with the pillars from slasher.",
                "user_rating": "7/10",
                "review_date": "19 December 2023"
            },
            {
                "review_title": "More creepy than scary, elevated by performances",
                "review_text": "At times it feels like a film school project, at times it is really good, but mostly it's creepy more than scary.Starts off like an 80's porno but lacks real feeling or meaning. It's a mcguffun (a term even mentioned in the film). Ok some pretty hot bodies but it's as sexy as making a porno probably is.The farmer and his wife are excellently cast and again creepy as F.Brittany Snow, Jenna Ortega and Mia Goth do great jobs of very archetypal characters with little story. Snow's singing is also impressive.However the switch into horror/slasher mode lacks scarriness, you know what's going to happen and it lacks suspense. Yeah it has referential scenes like the window in psycho, the \"here's Johnny\" scene from the Shinning, the lake and pier from Friday the 13th and others, but they are more like signposts than adding anything.Also the male actors, apart from the farmer, don't add much other than cannon fodder. Again archetypal characters but lacking the depth the girls bring.And it just gets crepier and well yuck near the end.The ending has a nice twist though.So for the performances and parts of the movie it is good but let down by execution, lack of suspense and just being a bit too ick for me. So it's a slasher 80's flick made for our times, a decent time waster but not a classic you will want to watch again and again.",
                "user_rating": "6/10",
                "review_date": "19 December 2023"
            },
            {
                "review_title": "X is unique for sure, but it didn't necessarily work for me.",
                "review_text": "Finally got around to watching Ti West's highly acclaimed film 'X,' and I have mixed feelings about it. It definitely boasts a fantastic retro vibe and a creepy, dreamlike atmosphere that lingers with you. There's a palpable sense of unease and impending doom throughout, which I absolutely loved. Additionally, Mia Goth delivers a stupendous performance in both her roles as Pearl and Maxxine. Her character, Pearl, is undeniably creepy and scary. The movie also features some brilliantly unhinged kills.However, the film does suffer from a disjointed narrative and, at times, feels like a parody. It gives the impression of being a collection of scenes rather than a cohesive movie. Furthermore, there are moments where it seems to strive for excessive artistry, which can be overwhelming.",
                "user_rating": "5/10",
                "review_date": "10 December 2023"
            },
            {
                "review_title": "Not Worth!",
                "review_text": "To be honest, I don't see any potential in the storyas a serial or slasher, the film is imitated solidlyI would praise the production for thatas for Mia Goth's role playing, all talent, this girl can play anythingwould say the same for Jenna Ortegabut i give mia goth the win in this movieunlike with the story of the film, the course of the film, I am disappointedthe movie doesn't make any sense like the middle of the movie is missingor would fall asleep every 2 minutesas a slasher film or a horror or thriller, it does not deserve this title at allA24 production has certain good filmsthis is really the worst horror this year for my taste.",
                "user_rating": "2/10",
                "review_date": "7 December 2023"
            },
            {
                "review_title": "Surprisingly Not Trash",
                "review_text": "I went in thinking \"Another low-budget slasher horror\", and I was wrong about \"another\" and \"low-budget\". Maybe this was filmed pre-Wednesday, but Jenna Ortega and Kid Cudi likely aren't cheap, and they dropped some serious needles on the soundtrack. The acting was great, the cinematography was great, and Ti West did an awesome job on the writing and direction. It dragged a bit towards the beginning, as these films tend to do, however a few of the things set up turned out to be Chekhov's Guns. The dialogue isn't remarkable, but there were times I was caught off guard by something realistic like \"oh yeah, that's probably what would actually happen if an 80lb octogenarian fired a gun\", and it attempts to address topics like aging and the meaning of love, which is ambitious for a slasher film. The characters had some depth, so I was invested in their struggles. There were multiple eye-roll moments, which goes with the genre. The special effects were pretty good.Since they were released in the same year I had to read the trivia to figure out this was filmed before Pearl, and while I thought the twist at the end of X was clever, the previews for 'Pearl' make it look like she was some kind of wacky killer before the start of X, which I think would hurt her character more than add to it.",
                "user_rating": "7/10",
                "review_date": "3 December 2023"
            }
        ]
    },
    {
        "s_no": 3,
        "movie_title": "Midsommar",
        "movie_year": "2019",
        "director_name": "Ari Aster",
        "imdb_rating": "7.1/10",
        "movie_url": "https://www.imdb.com/title/tt8772262/",
        "cast": [
            "Florence Pugh",
            "Jack Reynor",
            "Vilhelm Blomgren",
            "William Jackson Harper",
            "Will Poulter",
            "Ellora Torchia",
            "Archie Madekwe",
            "Henrik Norlen",
            "Gunnel Fred",
            "Isabelle Grill",
            "Agnes Rase",
            "Julia Ragnarsson",
            "Mats Blomgren",
            "Lars Varinger",
            "Anna Astrom",
            "Hampus Hallberg",
            "Liv Mjones",
            "Louise Peterhoff"
        ],
        "latest_10_reviews": [
            {
                "review_title": "Meh",
                "review_text": "Naturally, I can appreciate that any persons Taste In film is subjective, for me however it just felt like someone had watched, and enjoyed the Wickerman, afterwards then wanted to make a film were a bunch of stuff happens in a similar vain, to a group of characters I didn't care about. Personally, I wouldn't watch it again. But other people I know, absolutely love this film, and it came very highly recommended. Again, doesn't make it a bad film, just ended up being I personally didn't enjoy. May one day give it another punt, but certainly won't be today, or for a while. But each to their own.",
                "user_rating": "5/10",
                "review_date": "2 January 2024"
            },
            {
                "review_title": "Nonsense don't waste your time",
                "review_text": "What a nonsense garbage, boring from the beginning to the end, and I have seen a lot of movies that are garbage but this tops it.I get it's a movie but like none of the characters have a brain or what is happening to them or their friends, just shows how silly humans are when it comes to cults but I guess it the writers you can blame for the lacking in that department, still not sure what happened in the end I guess she really did join a cult just because what she been through just made sense for her to feel belonged and have a home these people give it her, I thought it would went other way around but still Don't waste your time.",
                "user_rating": "1/10",
                "review_date": "28 December 2023"
            },
            {
                "review_title": "Best psychological movie to ever exist!",
                "review_text": "I watched this film for the first time in summer and it was a great experience. Florence Pough (sorry if I spelt her name wrong) acted very well from the very beginning and deserves several awards from this performance alone. This is easily the best psychological horror film I have ever seen. Watching it for the first time was oddly comforting due to the aesthetics and vibrant colours, however as the movie went on it became more and more disturbing. The acting in it was incredible and I loved the plot. If you're looking to watch a psychological horror that feels summery, I would recommend this film! (Also a quick warning: don't watch this while high - you will regret it)",
                "user_rating": "10/10",
                "review_date": "28 December 2023"
            },
            {
                "review_title": "Magnificent camera work recalls Kubrick",
                "review_text": "For the last two months I've been doing the Marvel marathon, 20 movies so far. They're almost all worth watching if in the mood, but the lack of stillness in the camera, the constant cuts, quick quips, punchathons and artificial visuals get tiring after a while.Midsommar is a fine antidote: the camera is beautifully still or slow. Editing-cuts are far less frequent, allowing more time to sink into an image. The compositioning of images is masterful: photography-like. Indeed, Kubrick-like (who was initially a photographer).We also get an impactful soundtrack, excellent acting especially from the lead, good script & screenplay with plenty of quality dialogue-free sections, effectively spare FX with realistic psychedelic 'breathing' visuals, and a riveting foreboding atmosphere.There's also very weird humour, which actually made me & my lady laugh out loud a few times....tho' I imagine others might just find it weird.The film slightly drags in the final third (I watched the theatrical cut) and some of the character reactions will have you questioning its realism. The plot itself is fairly predictable...we've seen such films before. These are nitpicks as we also get a handful of strong memorable scenes.Overall a decent 8/10. Feels like a worthy tribute to 1973's The Wicker Man.",
                "user_rating": "8/10",
                "review_date": "27 December 2023"
            },
            {
                "review_title": "Lol",
                "review_text": "Lol.. OK I've put off watching this one now for like forever, mainly coz in my head I already predicted what it was about and the sort of vibe it would give off ( like moods in other films) and unfortunately I was 100% right. I will say in the first quatre or even less than that we get to see some beautiful scenery ( I will have to read up where it was filmed locations etc) and I did like the lead actress, she held the most potential.. and for a moment with the beautiful scenery I thought I might have made a wrong assumption on how the mood and theme of film would go & I'd be in for a nice viewing. Unfortunately none of the rest of the characters went anywhere. Even their friend who had taken them for a trip. It seemed like we d get more from him but then he quietened off. But first and foremost. The place just SCREAMED Cult as soon as we arrive in the village but like I said some nice scenery I was interested to see where it went. But unfortunately you'd really have to suspend belief too far on this, especially in regards to reactions and decisions. The film is long and slow paced aswell, making it even more unbelievable, they wouldn't of all just fled, especially after the mountains viewing & no1 would believe the London guy ditched his girlfriend & if I was her I would have clung to the Americans. This is where at least something like Hostel is rational in thinking YO!! Time to go!! Before even first person goes missing. It just became to anti climatic and stupid after the beautiful scenes and initial sacrifice. It was beyond predictable & I honestly feel they wasted a opportunity for a better film in their.",
                "user_rating": "5/10",
                "review_date": "27 December 2023"
            },
            {
                "review_title": "Didn't do it for me",
                "review_text": "'Midsommar' (2019)Opening thoughts: It took me a long time to get round to watching 'Midsommar', due to not having time or the opportunity to watch it easily. Have always appreciated the genre it fits in, where there are many great films, and Florence Pugh showed a lot of promise seeing her for the first time in 'Little Women'. That it was also directed by the director responsible for the very good 'Hereditary' intrigued me too. The premise was one of those could have gone either way ones, it was advertised bizarrely and the critical reception was very polarising, particularly from those that didn't like it.After seeing 'Midsommar', count me in as somebody who didn't care for it. It is not an awful film and there are things done right, including an intriguing start, but the second half was a bizarre and tedious mess, so this viewer is this case more understanding of those who didn't like the film than liked. This has absolutely nothing to do with not understanding what 'Midsommar' was going to be or going for, quite the opposite, the issue is that it doesn't achieve its aims very well at all.Good things: 'Midsommar' does have good things. It is a very well made film visually, with photography that is both dreamlike and nightmarish in all the necessary places. The scenery is also absolutely beautiful, while also with a suitably ominous atmosphere. Did think too that the film started off well, with an unsettling opening that was creepy and suspenseful. The sacrifice scene was similarly suitably horrifying, with it being the scariest (and goriest) the film got.Regarding the acting, to me it was quite good considering what was given to them (which actually come to think of it wasn't much). Pugh anchors the film beautifully in a compellingly tortured lead performance.Bad things: However, there are also a lot of drawbacks. Most of the characters are incredibly thinly sketched and behave annoyingly and/or illogically. Pugh has the only character that has any development or who is interesting. Some friends thought that Will Poulter's character had the most personality, to me actually he was annoying and his presence jarred with the rest of the atmosphere. The direction did have some slickness but got very slack and muddled later on the more weird the second half became.The script has nothing memorable, is very stilted and can fall into self-indulgence. The story and pacing are the weakest aspects of 'Midsommar'. The story starts off with great atmosphere and intrigue, but post the sacrifice scene any creepiness and sense of horror pretty much completely goes. Meaning that the second half is incredibly long winded, this out increasingly (at times non-existent) and is bizarre to the point of near-incoherence. Especially the dragged out and truly daft climax that ends on an abrupt, incomplete feeling note and one of the silliest and most unintentionally funny sex scenes in recent years.Some of the intended creepy behaviours of the cult were potentially unnerving and sounded it on paper but were under-explored and/or left as loose ends or implied. A much shorter length definitely would have helped the pacing and atmosphere, the film is overlong and could have easily been trimmed by 25-30 minutes which would have tightened the pace. Which would have been achieved if scenes were made shorter and if motivations went into more detail.Closing thoughts: Overall, underwhelming.4/10.",
                "user_rating": "4/10",
                "review_date": "26 December 2023"
            },
            {
                "review_title": "I wanted to love this....",
                "review_text": "I loved the directors previous film Hereditary. It was fresh if perhaps a bit bloated at times but it worked due to the plot's structure.So I was pretty stoked for this one. How many pure day light horror films are there? The Wicker Man (original) of which this film pays homage too, basically remakes it. And that is where ultimately, I was disappointment.First the good: The film is beautifully shot and minus 2 scenes the entire thing takes place in bright green fields of Sweden (shot in Hungary)It accomplishes merging beauty with horror in a way I haven't ever seen before (The Flower Dress)If you're a gore hound beyond just \"MORE GORE!\" then you may find certain scenes shocking (the cliff scene) as I did. It's not overly gory but with a background so beautiful for the heinous actions by both villagers and visitors it's quite jarring.There is also a suicide scene that raises a good question regarding how we \"civilized\" people tend to push our old/sick into institutions never to be seen again. Who are visitors to judge the customs of these \"sacred\" people?Sadly that theme is not explored and I found every character minus Dani to be interchangeable in their terriblenessIn closing.It feels like the director was, poorly, trying to remake the ultimate cult classic using the same methods that worked so well for his previous hit that what we end up with is a film that is\n100% predictable from start to finish. In other words I found it boring.I wanted to love it but didn't. I am very happy it was made as I think Ari Aster is an incredibly talented director who knows how to bring the terror and I look forward to his next work. I just hope he tries something unique and fun to watch.TLDR: This film follows the themes of Hereditary with zero twists, and while it is a gorgeous (and morbid) work of art- I didn't like it or hate it.",
                "user_rating": "6/10",
                "review_date": "26 December 2023"
            },
            {
                "review_title": "Weird and sometimes scary in the scandinavian midnight sun",
                "review_text": "This was a weird, but entertaining horror flick, that popped up on my danish TV app.As a dane, and thus a real life neighbor to the swedish settting in the film, it was quite entertaining to watch this Hollywood take on Midsommar, that pagan leftover in swedish culture, something that we danes no longer celebrate.The film is quite uneven and requires quite a bit of suspension of disbelief. Some scenes and traditions of the Hågra are too random to not have set off our protagonists in real life.Said protagonists are paper thin in the film, it's all about the Hågra and the setting.I will say this film is interesting from a scandinavian perspective, because it features a lot of swedish actors and a lot of blonde people. This still being normal here, particularly in places like rural Sweden.However, from an american point of view, that is increasingly diverse, I can see how this \"land of the blondes\" might seem very foreign. I found this reverse exocitism interesting to think about.Overall, I found the movie unnerving in parts, humorous in others. Well worth a watch.",
                "user_rating": "6/10",
                "review_date": "22 December 2023"
            },
            {
                "review_title": "Strangely Enjoyable",
                "review_text": "I'm not surprised by how divisive Midsommar is.It is a trippy, 3 hour horror movie, that's more weird than scary, but has excellent cinematography, an amazing performance by the lead (Florence Pugh), and impressive attention to detail.But you've obviously seen my rating and know that I enjoyed it, so let's talk about this film.Firstly, I'll note that I rarely leave reviews for films I watch. In fact, it's almost 10PM and I need to get to bed, but this film left me thinking.The first thing I noticed about this film was the amazing performance by Florence Pugh as Dani. We really get drawn into empathizing with her early on. And not just because of her intense loss at the very start of the film (shown in a brilliant opening sequence I might add).Her amazing performance only continues on until the final smiling shot.Another thing I thought was wonderful about this film was the foreshadowing. First, the depiction of a \"love story\" in which the woman serves a man food with her pubic hair and a drink containing her period blood. Then, the moment when Christian takes a drink and then we see his drink is a darker, redder color than the rest. That realization only forecasts what is to come for him.But there were tons of other moments of foreshadowing. The bear. The joke that no one lives past 72. And my favorite, a subversion of prior foreshadowing.Earlier in the film pair of elders arrives at the feast and everyone else waits to sit and eat until they do. They jump to their deaths moments later. Similarly, Dani as the May Queen goes through the same feasting ritual. And this makes us fear for her even more.And this brings me to another strength of this film, keeping us in suspense. The best example of this is when they cut away before Dani makes her selection of who will die. The movie takes its time marching people into the \"temple\". But not Christian. Only when we later see Christian in the room with the disemboweling of the bear do we start to suspect something is off.And the last huge strength I'll talk about is the theme. This film explores the themes of loss, trauma, and letting go. And I think it does a wonderful job thinking through these issues, mainly through the character of Dani. Everything tells us that her relationship with Christian is doomed to fail: from his distance and gaslighting, to the contrast between them and the Simon/Connie duo, to the fact that he's obviously hoping to \"mate\" with Maja. And yet, we struggle alongside her as she fails to let him go until the final shot.So yes, this is a very strange film. It is definitely not for anyone looking for supernatural hauntings, slashers, or another hollywood franchise. But if you are willing to try something different and have the patience and the open-mindedness to accept the strangeness as it comes, you might just find yourself having enjoyed one of the weirdest films you've ever watched.",
                "user_rating": "8/10",
                "review_date": "21 December 2023"
            },
            {
                "review_title": "What a beautiful, inspiring tale. And there is SO much of it.",
                "review_text": "When the credits were rolling, my heart was lifted.This is a movie we don't get often. A movie about community, about empathy. A movie about the importance of traditions, and even religion. Most of all, it's about sacrifice.Be warned, though: this film takes its time. If you want something more action-paced, I recommend the very similar-themed, but less lenghty The Wicker Man. The one from the 70s.This is not about thrills. The ending is clear, long before you get there. As I said: This movie REALLY dares to take its time. Don't expect too much tension, because although it might feel tense, sometimes, it also lasts long enough - and then some - to ease out any of these feelings.God, this is such a good movie about values.",
                "user_rating": "5/10",
                "review_date": "19 December 2023"
            }
        ]
    },
    {
        "s_no": 4,
        "movie_title": "Wind River",
        "movie_year": "2017",
        "director_name": "Taylor Sheridan",
        "imdb_rating": "7.7/10",
        "movie_url": "https://www.imdb.com/title/tt5362988/",
        "cast": [
            "Elizabeth Olsen",
            "Jeremy Renner",
            "Graham Greene",
            "Kelsey Asbille",
            "Julia Jones",
            "Teo Briones",
            "Apesanahkwat",
            "Tantoo Cardinal",
            "Eric Lange",
            "Gil Birmingham",
            "Althea Sam",
            "Tokala Black Elk",
            "Martin Sensmeier",
            "Tyler Laracca",
            "Shayne J. Cullen",
            "Dallin Tusieseina",
            "Austin R. Grant",
            "Ian Bohen"
        ],
        "latest_10_reviews": [
            {
                "review_title": "It's okay...",
                "review_text": "You can take Jeremy Renner out of Avengers but you can't take Avengers out of Jeremy Renner. His character is the strong silent type, he knows everything and speaks in cliches , he can track any man down and is seemingly more suited to investigate crime than the local police or FBI. Why are they even in the movie? This case is peanuts for the great hunter Cory Lambert. Let him to his thing.Elizabeth Olsen could be replaced by pretty much any female actor and the result would be same or even better. Do we have a shortage of talented women better suited for these kinds of roles? I don't know.The results of the investigation were disappointing. We find out that the girl was killed by some low IQ contractors who were so bad at doing crime that they just couldn't be bothered to cover anything up and couldn't keep their act together for two minutes after being approached by the police so they decided to just kill everyone so Cory could rush in at the last moment and be the hero that we need and deserve.Don't get me wrong , I'm not against this cheesy vigilante hero stuff, but it left me wanting more. It's very mediocre movie in basically all aspects.",
                "user_rating": "5/10",
                "review_date": "31 December 2023"
            },
            {
                "review_title": "\"WIND RIVER\" REVIEW",
                "review_text": "Directed and written by Taylor Sheridan. A runtime of one hour and forty-seven minutes. Streaming on Netflix with an R rating.\"Cory\" played by Jeremy Renner is a wildlife officer. Set in Wyoming he hunts predators and keeps things regulated in that regard. It's a very hard life in Wyoming. Very cold and quiet. He lives off the Native American reservation there.\"Cory\" had a Native American wife in \"Wilma\" played by Julia Jones. Along with an older daughter \"Emily\" and a son named \"Casey\" played by Teo Briones. There was a tragic event that happened to their daughter causing her to die.Now three years later \"Emily\" best friend \"Natalie\" played by Kelsey Asbille is found murdered. A neighboring state FBI agent \"Jane Banner\" played by Elizabeth Olsen is sent to investigate this murder.It doesn't take long before \"Jane\" realizes she's out of her depth. She enlist the help of the Reservation Officer \"Ben\" played by Graham Greene to help her. As well as \"Cory\" who feels obligated to help. Since this hits a little too close to home. Poking at old wounds.They will all try to get some justice for this slain young Native American woman.\"Wind River\" was a great film. When the film first came out I always wanted to see it. I just never got around to seeing it. Looking for something to watch I'm glad I stumbled on this. I also thought it was humorous they had \"The Punisher\"(Jon Bernthal), \"The Scarlet Witch\"(Elizabeth Olsen), and \"Hawkeye\"(Jeremy Renner) all in the same film. A little mini Marvel mashup.It did remind me of a film I just recently saw, \"The Silencing\" but done better. It was a fiction film but with very real elements in it. It also lets you know some pivotal information at the end. What Native Americans have been through in America and continue to go through is devastating. They don't even track the countless missing women that go missing every year.A powerful film. That was just the right amount of time. Taylor Sheridan wrote and directed an excellent film. There was one part script wise I felt left hanging a little but I can't complain because it felt like they went well out of their way to make sure everyone was satisfied in the end.This film has some raw and climatic scenes in it I tell you. Jon Bernthal plays \"messy\" so well. He's a phenomenal actor. Not to say he dives deep into his acting bag in this film. I just always liked his acting style. If he's in the film you know more times than not it's going to be a wild mess.Great film with a powerful message sprinkled in between it. Elizabeth and Jeremy have a great connection. Which is no shocker there. They are used to working with one another and it shows on screen. I give this film five mor fires 🔥🔥🔥🔥🔥.#CosmoandtheMovieWithin\n#CosmoMovieBlog\n#CosmoLanier\n#WindRiver.",
                "user_rating": "9/10",
                "review_date": "20 December 2023"
            },
            {
                "review_title": "Awesome cast and filming",
                "review_text": "This should be made into a series! Taylor Sheridan could highlight native Americans! Would be an amazing topic and sur he would make is with style and grace! And Jeremy Renner would rock a lead role! The way this was written, filmed and the male roles portrayed is epic! We need more movies and series with strong males and women of passion as well. And the scenery was beyond beautiful, peaceful, and so exspanive! No one films like Taylor Sheridan! Hope this film brings more native woman to our attention and more of them back home to their loved ones! This movie will stand the rest of time! Thanks to everyone involved!",
                "user_rating": "9/10",
                "review_date": "8 December 2023"
            },
            {
                "review_title": "Taylor Sheridan's Best Work!",
                "review_text": "I find it sad that Wind River flew well under the radar and did not get the praise/publicity that it deserved. This film features a very strong cast with an engaging storyline/Script. Make no mistake this film can be very brutal because of the content that is shown here but it's such an important story to show to the masses. I was aware going in that Indigenous women in the USA go missing everyday and they do not get the alerts/awareness that other races would get. That's why this film is based off of actual events because this kind of thing happens more then you think. Jeremy Renner and Elizabeth Olsen give terrific performances here and show a lot of chemistry on screen. Do yourself a favor and don't miss this one. Put it on your must watch list! Wind River gets a perfect score of 10 stars out of 10 from me.",
                "user_rating": "10/10",
                "review_date": "26 November 2023"
            },
            {
                "review_title": "Stunningly perfectb quiet, tense, authentic",
                "review_text": "Found this recently (late 2023), and I'm surprised this didn't have wider exposure. It's a VERY rare example of every element of a film being perfect throughout. There is no sense of acting, dialogue or directing intruding into the experience of being with these characters in this beautiful place, in this bleak circumstance. This a masterpiece from Taylor Sheridan. It's hard to imagine how every actor performs flawlessly, irrespective of his or her role. The visual compositions perfectly fit the narrative - nothing jarring or contrived, or out of step with the story - nothing there just to be noticed.Wind River keeps giving with every viewing. The acting and writing continue to deliver details and nuance that impress more deeply every time.This film is a treasure. Taylor Sheridan is a treasure who is not yet fully appreciated, and,we hope, not yet having reached his peak. We look forward to what he continues to offer.",
                "user_rating": "10/10",
                "review_date": "13 November 2023"
            },
            {
                "review_title": "\"You Survive Or You Surrender\"",
                "review_text": "Before there was the series \"Yellowstone\", there was \"Wind River\", written and directed by Taylor Sheridan and set in the same geographic area.Jeremy Renner is Cory Lambert, an employee of the U. S. Fish and Wildlife Service. He's a hunter, really, who gets paid to cull the herds and help maintain the balance between the wildness of nature and the domesticity of human life. When an FBI agent comes to investigate the death of a young Native American woman, the agent turns to Lambert for assistance, because she is out of her element. Agent Jane Banner is played by Elizabeth Olsen.The film is filled with accomplished actors. In this gritty police procedural, director Sheridan uses all their talents to create a tense and compelling drama that is rooted in events which actually happened. This means there will probably not be a sequel, but Lambert is a character worth seeing again. I imagine another story, years later, where Banner calls Lambert in on a homicide set in Las Vegas, because she needs \"a hunter\". Oh well, this one-off will do.",
                "user_rating": "8/10",
                "review_date": "10 November 2023"
            },
            {
                "review_title": "Familiar Tropes with Insightful Ways of Adding Beauty and Depth",
                "review_text": "A multitude of stories told without losing focus, all in a gorgeous setting where an immersive atmosphere is created through a fine combination of writing, cinematography and good performances.There is no grand surprise or innovation, but the all around good film-making keeps the attention perfectly for the full duration. It earns the capacity to create lasting impressions through small bits of dialogue or short scenes that don't stick out at the time of experiencing them for the first time. A bit more memorable score could have pushed this movie a bit further to become a true gem.A strange and wonderful thing that this movie got made in 2017 from 11 million dollars with 2 high-profile actors from the MCU. A good crime, drama with no fat or unnecessary bells and whistles.",
                "user_rating": "7/10",
                "review_date": "15 October 2023"
            },
            {
                "review_title": "So I helped solve an horrific crime...",
                "review_text": "And all I got you was this stuffed shark and a magazine. A magazine wondering what a woman should look for in a man.And the women of the world wept!Well thank god that after brutal rape (interesting autocorrect doesn't like THAT word), a man is there to reconcile the woman who solved the entire thing.A truly misguided attempt to show a woman's plight, buy people who will never actually understand that threat.The scenery was truly breathtaking.But the most breathtaking thing to me is that this is still acceptable. I would never allow my niece to watch this, except as an example of how we move forward.",
                "user_rating": "1/10",
                "review_date": "28 September 2023"
            },
            {
                "review_title": "Oh.. so slow and so average",
                "review_text": "What's with all the good reviews? This is at best an average crime thriller with zero suspense and no surprises. Jeremy Renner does his usual quiet tough \"lone wolf\" guy character on autopilot while Elisabeth Olsen as an FBI agent is far too young for her character to be taken seriously. Many people seem to admire the cold landscape, but for me it felt dull and boring. I also wonder why native Americans are always portrayed as drug addicted losers? Like \"Look what the white man did to those poor souls\". The dialogues are dull, wooden and predictable. After 2/3 of the movie the whole conspiracy is also revealed and from there it's pretty much game over.",
                "user_rating": "2/10",
                "review_date": "9 September 2023"
            },
            {
                "review_title": "How?",
                "review_text": "The scenery was amazing! The costumes were great. The lighting was iffy at best, except for the cop car scene (that was brilliant). The cast was great, sans the over actor. How? How does Elizabeth keep getting work, that is beyond her range? Acting is hard, but not impossible. Yet, her agent keeps tossing her roles, that she is not exactly able to perform. I am not saying that she cant act, I am saying that the acting that she does do, she puts her whole heart and soul into. Like Shatner doing MacBeth. I enjoyed her performance in Full House. You'd say \"she wasn't in Full House.\" To which I would say \"You are correct, thus her best acting to date.\"",
                "user_rating": "5/10",
                "review_date": "8 September 2023"
            }
        ]
    },
    {
        "s_no": 5,
        "movie_title": "Home Alone 2: Lost in New York",
        "movie_year": "1992",
        "director_name": "Chris Columbus",
        "imdb_rating": "6.9/10",
        "movie_url": "https://www.imdb.com/title/tt0104431/",
        "cast": [
            "Macaulay Culkin",
            "Joe Pesci",
            "Daniel Stern",
            "Catherine O'Hara",
            "John Heard",
            "Devin Ratray",
            "Hillary Wolf",
            "Maureen Elisabeth Shay",
            "Michael C. Maronna",
            "Gerry Bamman",
            "Terrie Snell",
            "Jedidiah Cohen",
            "Senta Moses",
            "Diana Rein",
            "Kieran Culkin",
            "Anna Slotky",
            "Tim Curry",
            "Brenda Fricker"
        ],
        "latest_10_reviews": [
            {
                "review_title": "Merry Christmas, ya filthy animal.",
                "review_text": "This is a very well-made and funny movie which meets all expectations. I guarantee that you will love it and it is the funniest family-friendly movie I've ever seen, besides Home Alone 1, that is. It's a very unique movie and had probably some of the best editing in a 1990s movie I've ever seen. The plot twists, character development, comedy and overall story blows me away. A lot funnier than most Christmas movies. This is coming from the perspective of a person who has very high standards and expectations when it comes to movies, especially festive movies. So sit back, relax, grab a snack of some sort and have fun watching the funniest Christmas movie available.",
                "user_rating": "10/10",
                "review_date": "3 January 2024"
            },
            {
                "review_title": "Christmas Classic, part II",
                "review_text": "Home Alone 2: Lost In New York picks up exactly where Home Alone left off. The movie follows faithfully the tried and tested method that brought huge success to the original, meaning that anyone who enjoyed the first movie should find this equally entertaining.Despite the obvious similarities between the two movies, there are a couple of important additions that differentiate them and should satisfy any skeptic viewers. First and foremost, this time around the action is transferred to New York, an ideal setting for a Christmas adventure. Secondly, the new members of the cast provide us with some memorable performances, the greatest of them being Tim Curry - honourable mention to Eddie Bracken's touching portrayal of Mr. Duncan.",
                "user_rating": "7/10",
                "review_date": "1 January 2024"
            },
            {
                "review_title": "Girlfriend keeps pausing the film",
                "review_text": "Watched this from 8pm with my girlfriend, currently 11pm and we're only 50 minutes into the film due to numerous trust exercises. She finds the boy really funny, and laughed when the robbers fell over on the pearls. She keeps giggling and pausing the film, talking about every scene asif she had created all the jokes herself. She is now eating left over Chinese and looks very happy with herself. Every character from the Angels with even filthier souls film has been googled to see which years the characters we're born, apparently its crazy that humans we're born in the 1800's, & most of them are being described as cute. She has just asked me what rating the film is, guessing it is a 12+, could anyone confirm this for me please?",
                "user_rating": "9/10",
                "review_date": "29 December 2023"
            },
            {
                "review_title": "Great Movie",
                "review_text": "REDUX (12/29/2023)\nRating: 9.2\nOverall, my favorite Christmas movie as this sequel builds on the iconic elements from the first movie, in a borderline satirical way, to show how Kevin can still outsmart the Sticky Bandits on an even larger scale.Great Direction (the direction on a macroscale is grander this time around as there is a higher production budget and the movie makes an effort to show how large New York is in comparison to Kevin; the direction microscale is pretty generic to 80s family comedies; the direction of actors is great as he can bring out the humor and joy in many moments, helps set the lighthearted tone that Kevin brings throughout the movie; storytelling is very similar to other John Hughes movies), Good Acting (Great from Macaulay Culkin (Continues to bring the youthful charm the movie is known for, Great from Joe Pesci (Continues to bring the comedic charm the movie is known for), Very Good from Daniel Stern (Continues to be the good comedic relief partner that plays off of Joe Pesci), Good to Very Good from Tim Curry, Good to Very Good from Catherine O'Hara, Pretty Good from the rest of the cast), Incredible Story (The concept is very satirical because the movie makes an effort to show that the story is the same one as the first (just grander); the plot structure follows the same plot structure as the first movie; flow between sequences is like the first in that its the standard John Hughes movie; character writing was very similar to the first movie as it replicates what the characters are going through this time around), Great Screenplay (The dialogue is pretty simple as its a family movie (but it is filled with iconic lines), the movie also uses dialogue to show how this movie is the same as the first; the humor was very good and iconic (also pokes fun at how this is the same movie as the first); the foreshadowing is good as it helps with showing the message of Kevin nothing being afraid), Great Score (Continues one of John Williams's most iconic scores), Good Cinematography, Good Sound, Good Editing, Visual Effects (), Good Production Design (Makes an effort to show how grand and regal all the places Kevin stays at in NYC), Pacing was great as it was a steady pace that used its runtime very nicely, Build to the climax was great as it helped tie loose ends in Kevin's fears of being alone and with the old man; the climax is the most iconic part of the movie as it shows Kevin against the Sticky Bandits as he lays the house out with traps to defend himself and show how he is not afraid anymore, Tone was very similar to other John Hughes movies (mixed with Christmas elements), This movie has more of a nostalgic factor for me because I watched it more as a childORIGINAL (01/05/2020)\nRating: 9.0\nGreat Acting By Culkin and Pesci, Very Funny, Iconic, Very Fun Movie to watch, Great Score, Great Screenplay, Great Story, Great Sequel.",
                "user_rating": "9/10",
                "review_date": "29 December 2023"
            },
            {
                "review_title": "Hot Take (maybe not that hot): Home Alone 2 > Home Alone",
                "review_text": "The two movies are incredibly similar (almost copy + paste), but I think that Home Alone 2 is the stronger of the two. While there was a chaotic energy when Kevin was left home alone, everything is elevated when he is alone in New York. The Plaza Hotel, Duncan's Toy Chest, the taxi ride over the Manhattan Bridge, standing atop the World Trade Center, the list goes on and on about Kevin's adventure in this film.While you have to suspend belief at the convenience of Harry & Marv running into Kevin again, their beatdown is absolutely marvelous. The thumping that Kevin gives to Marv specifically is legendary. The amount of brain damage or near death experiences given to that man in this film is too much to count.The pigeon lady is a bit rough around the edges, but the turtle love moment gives me the feels. The hotel staff, led by Tim Curry, is ridiculous and makes for some fantastic moments. At the end of the day, this movie is one of my favorite Christmas flicks of all time.Best Character: Marv\nBest Quote: \"Merry Christmas, you filthy animal.\" - Johnny\nBest Scene: Running in the Plaza and grabbing cookies from the minibar.Best Piece of Score: \"Finale\"\nSong: \"All Alone on Christmas\"",
                "user_rating": "9/10",
                "review_date": "28 December 2023"
            },
            {
                "review_title": "Little physcopath",
                "review_text": "They really said \"oh you liked the silly, funny, childish tricks from the first movie?\" And then made Kevin McAllister throw so many godamn bricks at these guys that I felt bad for the ROBBERS who were trying to steal CHARITY MONEY for KIDS IN NEED from a beloved TOY STORE. The robbers deserve financial compensation- there's something a little sick and twisted about the torture this time around, bricks, paint cans, electrical torture, fire. Is it really a happy ending if it doesn't end with Kevin, in a straight jacket, living in a facility for the mentally disturbed? I'm dubious.(Spoilers!!!!)",
                "user_rating": "6/10",
                "review_date": "26 December 2023"
            },
            {
                "review_title": "Classic",
                "review_text": "What can I say about this classic. I must of watched this about 100 times altogether - it's an absolutely incredible film that never gets boring.This time Kevin gets on the wrong plane and ends up near your whereas the rest of his family get on the plane to Florida.We see Kevin explore New York on his own, checking in to the hotel on his own and enjoying himself to start with.He ends up bumping into the sticky bandits and that's where it really starts. I just love the way Kevin comes up with all the traps, it's just really fun to watch.I love this movie and I recommend it to everyone.The BEST Christmas film!!",
                "user_rating": "10/10",
                "review_date": "25 December 2023"
            },
            {
                "review_title": "It's a big ole city",
                "review_text": "I probably prefer this film to the first film, and I think it's only heightened by the fact that this was set in New York, and the atmosphere of New York City is completely palpable. Since I can remember I've been totally enamoured with the appearance of lights in the dead of night, and their is a lot of those shots in this film, which I wholeheartedly appreciate. The clout that came from the first Home Alone, means that they production got to film in so many fantastic New York locations, like the Carnegie Hall and Rockafella Center. Kevin McCallister has always struck me as an incredibly clever kid, he is portrayed by the talented Macaulay Culkin, and he manages to showcase the smart as a whip personality without coming across as an arrogant. He also seems to have a magnetic charm that simply captures the affection to both children and adults alike. The aspect of the turtle doves was a nice inclusion, to be able to show to the audience the selfless nature of Kevin through his actions. Joe Pesci and Daniel Stern return to their roles as the thieves, and once again you have Joe Pesci playing the straight man, his styling of comedy in this film is brilliant to watch as he looks down upon Kevin with utter disdain. Not so much the feeling a sequel.",
                "user_rating": "8/10",
                "review_date": "24 December 2023"
            },
            {
                "review_title": "The Only Decent Sequel",
                "review_text": "We can criticize Home Alone for so many reboots that feel no charm to the original, but I can say that this is the only decent sequel. Home Alone 2: Lost In New York is the only sequel that feels faithful to the original and pretty enjoyable. Yeah, it does have the same plot of the first film with the same gimmicks. But it does bring out charm from the predecessor with and some clever and entertaining traps for the final act, great shots that gives a presentation of a New York City, characters that still have memorable personalities, and some new perspective of Kevin learning responsibility. I know fans of the first movie will probably like this. But keep in mind that again, this is going to be the same plot. So I will just give you a heads up on that if you're ever going to watch it. None of the sequels like this one will top the original, but at least this is the only one I can take compare to all the other stupid sequels/reboots that are made.",
                "user_rating": "7/10",
                "review_date": "23 December 2023"
            },
            {
                "review_title": "Lazy, but it's still good like the first",
                "review_text": "I really don't want to like this movie. It's possibly the laziest sequel in history. The messaging, the story progression, the B plots, the jokes and when they come, even some of the traps are all the exact same as the first or slightly altered. Macaulay kulkin also phones it in, in this movie his acting is so monotone. And yet despite all of this I'd say it's just as good as the first possibly better. Yes it's just the same thing done again and yes the acting isn't as good, but the new traps are so much better in this film and for what it's worth the repeated jokes are actually kinda funnier. I really don't want to like this movie for how lazy it is, but it's hard to not say this at the very least isn't as good as the first because the first one was so well done and this is the exact same with a different coat.",
                "user_rating": "8/10",
                "review_date": "22 December 2023"
            }
        ]
    }
]